#define _CRT_SECURE_NO_WARNINGS 10
#include<stdio.h>

//判断系统是大端还是小端
int test1(){

	int num = 1;
	return *(char*)&num;


}

void main(){
	//if (test1){
	//	printf("小端");
	//}else{
	//	printf("大端");
	//}

	//char a = 255;
	//printf("%d",a+1);

	int n = 9;
	//9的二进制
	//00000000 00000000 00000000 00010001
	// 9  以 float在内存中存储方式。
	
	//(-1)^0 * 1.0001 *2^4 (32位）
	//0 10000011 00010000 00000000 0000000
	//00000000101011001000000000000000
	float *p = &n;
	printf("%d\n",n);
	//此时按照float拿的数据为， 0 00000000 0000000 00000000 00010001
	//当E 全为0时，M不在加上第一位的1，而是还原小数0.xxx的小数，这样做为了表示正负0，以及接近0很小的数字。
	printf("%lf\n",*p);

	*p = 9.0;
	// 9  以 float在内存中存储方式。

	//(-1)^0 * 1.0001 *2^4 (32位）
	//0  00010000 00000000 0000000  10000011
	//0 10000011 00010000 00000000 0000000
	//n的值为：1099431936
	printf("%d\n", n);
	//p为9.0
	printf("%lf\n", *p);


}